tiborsimon/embedded-tdd-headers/pic/8bit/pic18c658_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18C658_H_
#define _PIC18C658_H_

#define RXF0SIDH                      0
#define RXF0SID3                      1
#define RXF0SIDH_SID3                 2
#define RXF0SID4                      3
#define RXF0SIDH_SID4                 4
#define RXF0SID5                      5
#define RXF0SIDH_SID5                 6
#define RXF0SID6                      7
#define RXF0SIDH_SID6                 8
#define RXF0SID7                      9
#define RXF0SIDH_SID7                 10
#define RXF0SID8                      11
#define RXF0SIDH_SID8                 12
#define RXF0SID9                      13
#define RXF0SIDH_SID9                 14
#define RXF0SID10                     15
#define RXF0SIDH_SID10                16
#define RXF0SIDL                      17
#define RXF0SIDL_EID16                18
#define RXF0EID16                     19
#define RXF0SIDL_EID17                20
#define RXF0EID17                     21
#define RXF0EXIDEN                    22
#define RXF0SIDL_EXIDE                23
#define RXF0SIDL_EXIDEN               24
#define RXF0SID0                      25
#define RXF0SIDL_SID0                 26
#define RXF0SIDL_SID1                 27
#define RXF0SID1                      28
#define RXF0SID2                      29
#define RXF0SIDL_SID2                 30
#define RXF0EIDH                      31
#define RXF0EIDH_EID8                 32
#define RXF0EID8                      33
#define RXF0EIDH_EID9                 34
#define RXF0EID9                      35
#define RXF0EIDH_EID10                36
#define RXF0EID10                     37
#define RXF0EIDH_EID11                38
#define RXF0EID11                     39
#define RXF0EIDH_EID12                40
#define RXF0EID12                     41
#define RXF0EIDH_EID13                42
#define RXF0EID13                     43
#define RXF0EIDH_EID14                44
#define RXF0EID14                     45
#define RXF0EIDH_EID15                46
#define RXF0EID15                     47
#define RXF0EIDL                      48
#define RXF0EIDL_EID0                 49
#define RXF0EID0                      50
#define RXF0EIDL_EID1                 51
#define RXF0EID1                      52
#define RXF0EIDL_EID2                 53
#define RXF0EID2                      54
#define RXF0EIDL_EID3                 55
#define RXF0EID3                      56
#define RXF0EIDL_EID4                 57
#define RXF0EID4                      58
#define RXF0EIDL_EID5                 59
#define RXF0EID5                      60
#define RXF0EIDL_EID6                 61
#define RXF0EID6                      62
#define RXF0EIDL_EID7                 63
#define RXF0EID7                      64
#define RXF1SIDH                      65
#define RXF1SID3                      66
#define RXF1SIDH_SID3                 67
#define RXF1SID4                      68
#define RXF1SIDH_SID4                 69
#define RXF1SID5                      70
#define RXF1SIDH_SID5                 71
#define RXF1SID6                      72
#define RXF1SIDH_SID6                 73
#define RXF1SID7                      74
#define RXF1SIDH_SID7                 75
#define RXF1SID8                      76
#define RXF1SIDH_SID8                 77
#define RXF1SID9                      78
#define RXF1SIDH_SID9                 79
#define RXF1SIDH_SID10                80
#define RXF1SID10                     81
#define RXF1SIDL                      82
#define RXF1SIDL_EID16                83
#define RXF1EID16                     84
#define RXF1SIDL_EID17                85
#define RXF1EID17                     86
#define RXF1EXIDEN                    87
#define RXF1SIDL_EXIDE                88
#define RXF1SIDL_EXIDEN               89
#define RXF1SIDL_SID0                 90
#define RXF1SID0                      91
#define RXF1SIDL_SID1                 92
#define RXF1SID1                      93
#define RXF1SID2                      94
#define RXF1SIDL_SID2                 95
#define RXF1EIDH                      96
#define RXF1EID8                      97
#define RXF1EIDH_EID8                 98
#define RXF1EID9                      99
#define RXF1EIDH_EID9                 100
#define RXF1EIDH_EID10                101
#define RXF1EID10                     102
#define RXF1EIDH_EID11                103
#define RXF1EID11                     104
#define RXF1EIDH_EID12                105
#define RXF1EID12                     106
#define RXF1EIDH_EID13                107
#define RXF1EID13                     108
#define RXF1EIDH_EID14                109
#define RXF1EID14                     110
#define RXF1EIDH_EID15                111
#define RXF1EID15                     112
#define RXF1EIDL                      113
#define RXF1EID0                      114
#define RXF1EIDL_EID0                 115
#define RXF1EID1                      116
#define RXF1EIDL_EID1                 117
#define RXF1EID2                      118
#define RXF1EIDL_EID2                 119
#define RXF1EID3                      120
#define RXF1EIDL_EID3                 121
#define RXF1EID4                      122
#define RXF1EIDL_EID4                 123
#define RXF1EID5                      124
#define RXF1EIDL_EID5                 125
#define RXF1EID6                      126
#define RXF1EIDL_EID6                 127
#define RXF1EIDL_EID7                 128
#define RXF1EID7                      129
#define RXF2SIDH                      130
#define RXF2SID3                      131
#define RXF2SIDH_SID3                 132
#define RXF2SID4                      133
#define RXF2SIDH_SID4                 134
#define RXF2SID5                      135
#define RXF2SIDH_SID5                 136
#define RXF2SID6                      137
#define RXF2SIDH_SID6                 138
#define RXF2SID7                      139
#define RXF2SIDH_SID7                 140
#define RXF2SID8                      141
#define RXF2SIDH_SID8                 142
#define RXF2SID9                      143
#define RXF2SIDH_SID9                 144
#define RXF2SID10                     145
#define RXF2SIDH_SID10                146
#define RXF2SIDL                      147
#define RXF2SIDL_EID16                148
#define RXF2EID16                     149
#define RXF2SIDL_EID17                150
#define RXF2EID17                     151
#define RXF2SIDL_EXIDE                152
#define RXF2EXIDEN                    153
#define RXF2SIDL_EXIDEN               154
#define RXF2SID0                      155
#define RXF2SIDL_SID0                 156
#define RXF2SID1                      157
#define RXF2SIDL_SID1                 158
#define RXF2SID2                      159
#define RXF2SIDL_SID2                 160
#define RXF2EIDH                      161
#define RXF2EID8                      162
#define RXF2EIDH_EID8                 163
#define RXF2EID9                      164
#define RXF2EIDH_EID9                 165
#define RXF2EID10                     166
#define RXF2EIDH_EID10                167
#define RXF2EIDH_EID11                168
#define RXF2EID11                     169
#define RXF2EIDH_EID12                170
#define RXF2EID12                     171
#define RXF2EIDH_EID13                172
#define RXF2EID13                     173
#define RXF2EIDH_EID14                174
#define RXF2EID14                     175
#define RXF2EIDH_EID15                176
#define RXF2EID15                     177
#define RXF2EIDL                      178
#define RXF2EID0                      179
#define RXF2EIDL_EID0                 180
#define RXF2EID1                      181
#define RXF2EIDL_EID1                 182
#define RXF2EID2                      183
#define RXF2EIDL_EID2                 184
#define RXF2EID3                      185
#define RXF2EIDL_EID3                 186
#define RXF2EID4                      187
#define RXF2EIDL_EID4                 188
#define RXF2EID5                      189
#define RXF2EIDL_EID5                 190
#define RXF2EID6                      191
#define RXF2EIDL_EID6                 192
#define RXF2EID7                      193
#define RXF2EIDL_EID7                 194
#define RXF3SIDH                      195
#define RXF3SID3                      196
#define RXF3SIDH_SID3                 197
#define RXF3SIDH_SID4                 198
#define RXF3SID4                      199
#define RXF3SIDH_SID5                 200
#define RXF3SID5                      201
#define RXF3SIDH_SID6                 202
#define RXF3SID6                      203
#define RXF3SIDH_SID7                 204
#define RXF3SID7                      205
#define RXF3SIDH_SID8                 206
#define RXF3SID8                      207
#define RXF3SIDH_SID9                 208
#define RXF3SID9                      209
#define RXF3SID10                     210
#define RXF3SIDH_SID10                211
#define RXF3SIDL                      212
#define RXF3SIDL_EID16                213
#define RXF3EID16                     214
#define RXF3EID17                     215
#define RXF3SIDL_EID17                216
#define RXF3SIDL_EXIDE                217
#define RXF3SIDL_EXIDEN               218
#define RXF3EXIDEN                    219
#define RXF3SIDL_SID0                 220
#define RXF3SID0                      221
#define RXF3SIDL_SID1                 222
#define RXF3SID1                      223
#define RXF3SIDL_SID2                 224
#define RXF3SID2                      225
#define RXF3EIDH                      226
#define RXF3EIDH_EID8                 227
#define RXF3EID8                      228
#define RXF3EIDH_EID9                 229
#define RXF3EID9                      230
#define RXF3EIDH_EID10                231
#define RXF3EID10                     232
#define RXF3EIDH_EID11                233
#define RXF3EID11                     234
#define RXF3EIDH_EID12                235
#define RXF3EID12                     236
#define RXF3EIDH_EID13                237
#define RXF3EID13                     238
#define RXF3EIDH_EID14                239
#define RXF3EID14                     240
#define RXF3EIDH_EID15                241
#define RXF3EID15                     242
#define RXF3EIDL                      243
#define RXF3EID0                      244
#define RXF3EIDL_EID0                 245
#define RXF3EID1                      246
#define RXF3EIDL_EID1                 247
#define RXF3EID2                      248
#define RXF3EIDL_EID2                 249
#define RXF3EID3                      250
#define RXF3EIDL_EID3                 251
#define RXF3EID4                      252
#define RXF3EIDL_EID4                 253
#define RXF3EID5                      254
#define RXF3EIDL_EID5                 255
#define RXF3EID6                      256
#define RXF3EIDL_EID6                 257
#define RXF3EID7                      258
#define RXF3EIDL_EID7                 259
#define RXF4SIDH                      260
#define RXF4SID3                      261
#define RXF4SIDH_SID3                 262
#define RXF4SID4                      263
#define RXF4SIDH_SID4                 264
#define RXF4SID5                      265
#define RXF4SIDH_SID5                 266
#define RXF4SID6                      267
#define RXF4SIDH_SID6                 268
#define RXF4SID7                      269
#define RXF4SIDH_SID7                 270
#define RXF4SID8                      271
#define RXF4SIDH_SID8                 272
#define RXF4SID9                      273
#define RXF4SIDH_SID9                 274
#define RXF4SIDH_SID10                275
#define RXF4SID10                     276
#define RXF4SIDL                      277
#define RXF4EID16                     278
#define RXF4SIDL_EID16                279
#define RXF4EID17                     280
#define RXF4SIDL_EID17                281
#define RXF4SIDL_EXIDE                282
#define RXF4SIDL_EXIDEN               283
#define RXF4EXIDEN                    284
#define RXF4SID0                      285
#define RXF4SIDL_SID0                 286
#define RXF4SIDL_SID1                 287
#define RXF4SID1                      288
#define RXF4SID2                      289
#define RXF4SIDL_SID2                 290
#define RXF4EIDH                      291
#define RXF4EID8                      292
#define RXF4EIDH_EID8                 293
#define RXF4EID9                      294
#define RXF4EIDH_EID9                 295
#define RXF4EID10                     296
#define RXF4EIDH_EID10                297
#define RXF4EID11                     298
#define RXF4EIDH_EID11                299
#define RXF4EID12                     300
#define RXF4EIDH_EID12                301
#define RXF4EID13                     302
#define RXF4EIDH_EID13                303
#define RXF4EID14                     304
#define RXF4EIDH_EID14                305
#define RXF4EID15                     306
#define RXF4EIDH_EID15                307
#define RXF4EIDL                      308
#define RXF4EID0                      309
#define RXF4EIDL_EID0                 310
#define RXF4EID1                      311
#define RXF4EIDL_EID1                 312
#define RXF4EID2                      313
#define RXF4EIDL_EID2                 314
#define RXF4EID3                      315
#define RXF4EIDL_EID3                 316
#define RXF4EID4                      317
#define RXF4EIDL_EID4                 318
#define RXF4EID5                      319
#define RXF4EIDL_EID5                 320
#define RXF4EID6                      321
#define RXF4EIDL_EID6                 322
#define RXF4EID7                      323
#define RXF4EIDL_EID7                 324
#define RXF5SIDH                      325
#define RXF5SIDH_SID3                 326
#define RXF5SID3                      327
#define RXF5SIDH_SID4                 328
#define RXF5SID4                      329
#define RXF5SIDH_SID5                 330
#define RXF5SID5                      331
#define RXF5SIDH_SID6                 332
#define RXF5SID6                      333
#define RXF5SIDH_SID7                 334
#define RXF5SID7                      335
#define RXF5SIDH_SID8                 336
#define RXF5SID8                      337
#define RXF5SIDH_SID9                 338
#define RXF5SID9                      339
#define RXF5SIDH_SID10                340
#define RXF5SID10                     341
#define RXF5SIDL                      342
#define RXF5EID16                     343
#define RXF5SIDL_EID16                344
#define RXF5EID17                     345
#define RXF5SIDL_EID17                346
#define RXF5SIDL_EXIDEN               347
#define RXF5EXIDEN                    348
#define RXF5SIDL_EXIDE                349
#define RXF5SIDL_SID0                 350
#define RXF5SID0                      351
#define RXF5SID1                      352
#define RXF5SIDL_SID1                 353
#define RXF5SIDL_SID2                 354
#define RXF5SID2                      355
#define RXF5EIDH                      356
#define RXF5EIDH_EID8                 357
#define RXF5EID8                      358
#define RXF5EIDH_EID9                 359
#define RXF5EID9                      360
#define RXF5EIDH_EID10                361
#define RXF5EID10                     362
#define RXF5EIDH_EID11                363
#define RXF5EID11                     364
#define RXF5EIDH_EID12                365
#define RXF5EID12                     366
#define RXF5EIDH_EID13                367
#define RXF5EID13                     368
#define RXF5EIDH_EID14                369
#define RXF5EID14                     370
#define RXF5EIDH_EID15                371
#define RXF5EID15                     372
#define RXF5EIDL                      373
#define RXF5EIDL_EID0                 374
#define RXF5EID0                      375
#define RXF5EIDL_EID1                 376
#define RXF5EID1                      377
#define RXF5EIDL_EID2                 378
#define RXF5EID2                      379
#define RXF5EIDL_EID3                 380
#define RXF5EID3                      381
#define RXF5EIDL_EID4                 382
#define RXF5EID4                      383
#define RXF5EIDL_EID5                 384
#define RXF5EID5                      385
#define RXF5EIDL_EID6                 386
#define RXF5EID6                      387
#define RXF5EIDL_EID7                 388
#define RXF5EID7                      389
#define RXM0SIDH                      390
#define RXM0SIDH_SID3                 391
#define RXM0SID3                      392
#define RXM0SIDH_SID4                 393
#define RXM0SID4                      394
#define RXM0SIDH_SID5                 395
#define RXM0SID5                      396
#define RXM0SIDH_SID6                 397
#define RXM0SID6                      398
#define RXM0SIDH_SID7                 399
#define RXM0SID7                      400
#define RXM0SIDH_SID8                 401
#define RXM0SID8                      402
#define RXM0SIDH_SID9                 403
#define RXM0SID9                      404
#define RXM0SID10                     405
#define RXM0SIDH_SID10                406
#define RXM0SIDL                      407
#define RXM0SIDL_EID16                408
#define RXM0EID16                     409
#define RXM0EID17                     410
#define RXM0SIDL_EID17                411
#define RXM0SID0                      412
#define RXM0SIDL_SID0                 413
#define RXM0SID1                      414
#define RXM0SIDL_SID1                 415
#define RXM0SID2                      416
#define RXM0SIDL_SID2                 417
#define RXM0EIDH                      418
#define RXM0EIDH_EID8                 419
#define RXM0EID8                      420
#define RXM0EIDH_EID9                 421
#define RXM0EID9                      422
#define RXM0EIDH_EID10                423
#define RXM0EID10                     424
#define RXM0EIDH_EID11                425
#define RXM0EID11                     426
#define RXM0EIDH_EID12                427
#define RXM0EID12                     428
#define RXM0EIDH_EID13                429
#define RXM0EID13                     430
#define RXM0EIDH_EID14                431
#define RXM0EID14                     432
#define RXM0EIDH_EID15                433
#define RXM0EID15                     434
#define RXM0EIDL                      435
#define RXM0EIDL_EID0                 436
#define RXM0EID0                      437
#define RXM0EIDL_EID1                 438
#define RXM0EID1                      439
#define RXM0EIDL_EID2                 440
#define RXM0EID2                      441
#define RXM0EIDL_EID3                 442
#define RXM0EID3                      443
#define RXM0EIDL_EID4                 444
#define RXM0EID4                      445
#define RXM0EIDL_EID5                 446
#define RXM0EID5                      447
#define RXM0EIDL_EID6                 448
#define RXM0EID6                      449
#define RXM0EIDL_EID7                 450
#define RXM0EID7                      451
#define RXM1SIDH                      452
#define RXM1SID3                      453
#define RXM1SIDH_SID3                 454
#define RXM1SID4                      455
#define RXM1SIDH_SID4                 456
#define RXM1SID5                      457
#define RXM1SIDH_SID5                 458
#define RXM1SID6                      459
#define RXM1SIDH_SID6                 460
#define RXM1SID7                      461
#define RXM1SIDH_SID7                 462
#define RXM1SIDH_SID8                 463
#define RXM1SID8                      464
#define RXM1SID9                      465
#define RXM1SIDH_SID9                 466
#define RXM1SIDH_SID10                467
#define RXM1SID10                     468
#define RXM1SIDL                      469
#define RXM1SIDL_EID16                470
#define RXM1EID16                     471
#define RXM1SIDL_EID17                472
#define RXM1EID17                     473
#define RXM1SID0                      474
#define RXM1SIDL_SID0                 475
#define RXM1SID1                      476
#define RXM1SIDL_SID1                 477
#define RXM1SID2                      478
#define RXM1SIDL_SID2                 479
#define RXM1EIDH                      480
#define RXM1EID8                      481
#define RXM1EIDH_EID8                 482
#define RXM1EID9                      483
#define RXM1EIDH_EID9                 484
#define RXM1EIDH_EID10                485
#define RXM1EID10                     486
#define RXM1EIDH_EID11                487
#define RXM1EID11                     488
#define RXM1EIDH_EID12                489
#define RXM1EID12                     490
#define RXM1EIDH_EID13                491
#define RXM1EID13                     492
#define RXM1EIDH_EID14                493
#define RXM1EID14                     494
#define RXM1EIDH_EID15                495
#define RXM1EID15                     496
#define RXM1EIDL                      497
#define RXM1EID0                      498
#define RXM1EIDL_EID0                 499
#define RXM1EID1                      500
#define RXM1EIDL_EID1                 501
#define RXM1EID2                      502
#define RXM1EIDL_EID2                 503
#define RXM1EID3                      504
#define RXM1EIDL_EID3                 505
#define RXM1EIDL_EID4                 506
#define RXM1EID4                      507
#define RXM1EIDL_EID5                 508
#define RXM1EID5                      509
#define RXM1EID6                      510
#define RXM1EIDL_EID6                 511
#define RXM1EID7                      512
#define RXM1EIDL_EID7                 513
#define TXB2CON                       514
#define TXB2PRI0                      515
#define TXB2CON_TXPRI0                516
#define TXB2PRI1                      517
#define TXB2CON_TXPRI1                518
#define TXB2REQ                       519
#define TXB2CON_TXREQ                 520
#define TXB2ERR                       521
