tiborsimon/embedded-tdd-headers/pic/8bit/pic18c658_tdd.h
#define TXB2CON_TXERR                 522
#define TXB2CON_TXLARB                523
#define TXB2LARB                      524
#define TXB2ABT                       525
#define TXB2CON_TXABT                 526
#define TXB2SIDH                      527
#define TXB2SID3                      528
#define TXB2SIDH_SID3                 529
#define TXB2SID4                      530
#define TXB2SIDH_SID4                 531
#define TXB2SID5                      532
#define TXB2SIDH_SID5                 533
#define TXB2SID6                      534
#define TXB2SIDH_SID6                 535
#define TXB2SID7                      536
#define TXB2SIDH_SID7                 537
#define TXB2SID8                      538
#define TXB2SIDH_SID8                 539
#define TXB2SID9                      540
#define TXB2SIDH_SID9                 541
#define TXB2SIDH_SID10                542
#define TXB2SID10                     543
#define TXB2SIDL                      544
#define TXB2SIDL_EID16                545
#define TXB2EID16                     546
#define TXB2SIDL_EID17                547
#define TXB2EID17                     548
#define TXB2SIDL_EXIDE                549
#define TXB2EXIDE                     550
#define TXB2SIDL_EXID                 551
#define TXB2SIDL_SID0                 552
#define TXB2SID0                      553
#define TXB2SIDL_SID1                 554
#define TXB2SID1                      555
#define TXB2SIDL_SID2                 556
#define TXB2SID2                      557
#define TXB2EIDH                      558
#define TXB2EIDH_EID8                 559
#define TXB2EID8                      560
#define TXB2EIDH_EID9                 561
#define TXB2EID9                      562
#define TXB2EIDH_EID10                563
#define TXB2EID10                     564
#define TXB2EIDH_EID11                565
#define TXB2EID11                     566
#define TXB2EIDH_EID12                567
#define TXB2EID12                     568
#define TXB2EIDH_EID13                569
#define TXB2EID13                     570
#define TXB2EIDH_EID14                571
#define TXB2EID14                     572
#define TXB2EIDH_EID15                573
#define TXB2EID15                     574
#define TXB2EIDL                      575
#define TXB2EID0                      576
#define TXB2EIDL_EID0                 577
#define TXB2EID1                      578
#define TXB2EIDL_EID1                 579
#define TXB2EID2                      580
#define TXB2EIDL_EID2                 581
#define TXB2EID3                      582
#define TXB2EIDL_EID3                 583
#define TXB2EID4                      584
#define TXB2EIDL_EID4                 585
#define TXB2EID5                      586
#define TXB2EIDL_EID5                 587
#define TXB2EID6                      588
#define TXB2EIDL_EID6                 589
#define TXB2EID7                      590
#define TXB2EIDL_EID7                 591
#define TXB2DLC                       592
#define TXB2DLC0                      593
#define TXB2DLC_DLC0                  594
#define DCL0                          595
#define TXB2DLC1                      596
#define TXB2DLC_DLC1                  597
#define TXB2DLC2                      598
#define TXB2DLC_DLC2                  599
#define TXB2DLC_DLC3                  600
#define TXB2DLC3                      601
#define TXB2DLC_TXRTR                 602
#define TXB2DLC_RTR                   603
#define TXB2RTR                       604
#define TXB2D0                        605
#define TXB2D00                       606
#define TXB2D01                       607
#define TXB2D02                       608
#define TXB2D03                       609
#define TXB2D04                       610
#define TXB2D05                       611
#define TXB2D06                       612
#define TXB2D07                       613
#define TXB2D1                        614
#define TXB2D10                       615
#define TXB2D11                       616
#define TXB2D12                       617
#define TXB2D13                       618
#define TXB2D14                       619
#define TXB2D15                       620
#define TXB2D16                       621
#define TXB2D17                       622
#define TXB2D2                        623
#define TXB2D20                       624
#define TXB2D21                       625
#define TXB2D22                       626
#define TXB2D23                       627
#define TXB2D24                       628
#define TXB2D25                       629
#define TXB2D26                       630
#define TXB2D27                       631
#define TXB2D3                        632
#define TXB2D30                       633
#define TXB2D31                       634
#define TXB2D32                       635
#define TXB2D33                       636
#define TXB2D34                       637
#define TXB2D35                       638
#define TXB2D36                       639
#define TXB2D37                       640
#define TXB2D4                        641
#define TXB2D40                       642
#define TXB2D41                       643
#define TXB2D42                       644
#define TXB2D43                       645
#define TXB2D44                       646
#define TXB2D45                       647
#define TXB2D46                       648
#define TXB2D47                       649
#define TXB2D5                        650
#define TXB2D50                       651
#define TXB2D51                       652
#define TXB2D52                       653
#define TXB2D53                       654
#define TXB2D54                       655
#define TXB2D55                       656
#define TXB2D56                       657
#define TXB2D57                       658
#define TXB2D6                        659
#define TXB2D60                       660
#define TXB2D61                       661
#define TXB2D62                       662
#define TXB2D63                       663
#define TXB2D64                       664
#define TXB2D65                       665
#define TXB2D66                       666
#define TXB2D67                       667
#define TXB2D7                        668
#define TXB2D70                       669
#define TXB2D71                       670
#define TXB2D72                       671
#define TXB2D73                       672
#define TXB2D74                       673
#define TXB2D75                       674
#define TXB2D76                       675
#define TXB2D77                       676
#define CANSTATRO3                    677
#define CANSTATRO3_ICODE0             678
#define CANSTATRO3_ICODE1             679
#define CANSTATRO3_ICODE2             680
#define CANSTATRO3_OPMODE0            681
#define CANSTATRO3_OPMODE1            682
#define CANSTATRO3_OPMODE2            683
#define TXB1CON                       684
#define TXB1PRI0                      685
#define TXB1CON_TXPRI0                686
#define TXB1PRI1                      687
#define TXB1CON_TXPRI1                688
#define TXB1CON_TXREQ                 689
#define TXB1REQ                       690
#define TXB1CON_TXERR                 691
#define TXB1ERR                       692
#define TXB1CON_TXLARB                693
#define TXB1LARB                      694
#define TXB1ABT                       695
#define TXB1CON_TXABT                 696
#define TXB1SIDH                      697
#define TXB1SIDH_SID3                 698
#define TXB1SID3                      699
#define TXB1SIDH_SID4                 700
#define TXB1SID4                      701
#define TXB1SIDH_SID5                 702
#define TXB1SID5                      703
#define TXB1SIDH_SID6                 704
#define TXB1SID6                      705
#define TXB1SIDH_SID7                 706
#define TXB1SID7                      707
#define TXB1SIDH_SID8                 708
#define TXB1SID8                      709
#define TXB1SIDH_SID9                 710
#define TXB1SID9                      711
#define TXB1SID10                     712
#define TXB1SIDH_SID10                713
#define TXB1SIDL                      714
#define TXB1SIDL_EID16                715
#define TXB1EID16                     716
#define TXB1SIDL_EID17                717
#define TXB1EID17                     718
#define TXB1EXIDE                     719
#define TXB1SIDL_EXIDE                720
#define TXB1SIDL_EXID                 721
#define TXB1SID0                      722
#define TXB1SIDL_SID0                 723
#define TXB1SID1                      724
#define TXB1SIDL_SID1                 725
#define TXB1SID2                      726
#define TXB1SIDL_SID2                 727
#define TXB1EIDH                      728
#define TXB1EID8                      729
#define TXB1EIDH_EID8                 730
#define TXB1EID9                      731
#define TXB1EIDH_EID9                 732
#define TXB1EID10                     733
#define TXB1EIDH_EID10                734
#define TXB1EID11                     735
#define TXB1EIDH_EID11                736
#define TXB1EID12                     737
#define TXB1EIDH_EID12                738
#define TXB1EID13                     739
#define TXB1EIDH_EID13                740
#define TXB1EID14                     741
#define TXB1EIDH_EID14                742
#define TXB1EID15                     743
#define TXB1EIDH_EID15                744
#define TXB1EIDL                      745
#define TXB1EIDL_EID0                 746
#define TXB1EID0                      747
#define TXB1EIDL_EID1                 748
#define TXB1EID1                      749
#define TXB1EIDL_EID2                 750
#define TXB1EID2                      751
#define TXB1EIDL_EID3                 752
#define TXB1EID3                      753
#define TXB1EIDL_EID4                 754
#define TXB1EID4                      755
#define TXB1EIDL_EID5                 756
#define TXB1EID5                      757
#define TXB1EIDL_EID6                 758
#define TXB1EID6                      759
#define TXB1EIDL_EID7                 760
#define TXB1EID7                      761
#define TXB1DLC                       762
#define TXB1DLC0                      763
#define TXB1DLC_DLC0                  764
#define TXB1DLC_DLC1                  765
#define TXB1DLC1                      766
#define TXB1DLC_DLC2                  767
#define TXB1DLC2                      768
#define TXB1DLC3                      769
#define TXB1DLC_DLC3                  770
#define TXB1RTR                       771
#define TXB1DLC_RTR                   772
#define TXB1DLC_TXRTR                 773
#define TXB1D0                        774
#define TXB1D00                       775
#define TXB1D01                       776
#define TXB1D02                       777
#define TXB1D03                       778
#define TXB1D04                       779
#define TXB1D05                       780
#define TXB1D06                       781
#define TXB1D07                       782
#define TXB1D1                        783
#define TXB1D10                       784
#define TXB1D11                       785
#define TXB1D12                       786
#define TXB1D13                       787
#define TXB1D14                       788
#define TXB1D15                       789
#define TXB1D16                       790
#define TXB1D17                       791
#define TXB1D2                        792
#define TXB1D20                       793
#define TXB1D21                       794
#define TXB1D22                       795
#define TBB1D23                       796
#define TXB1D23                       797
#define TXB1D24                       798
#define TXB1D25                       799
#define TXB1D26                       800
#define TXB1D27                       801
#define TXB1D3                        802
#define TXB1D30                       803
#define TXB1D31                       804
#define TXB1D32                       805
#define TXB1D33                       806
#define TXB1D34                       807
#define TXB1D35                       808
#define TXB1D36                       809
#define TXB1D37                       810
#define TXB1D4                        811
#define TXB1D40                       812
#define TXB1D41                       813
#define TXB1D42                       814
#define TXB1D43                       815
#define TXB1D44                       816
#define TXB1D45                       817
#define TXB1D46                       818
#define TXB1D47                       819
#define TXB1D5                        820
#define TXB1D50                       821
#define TXB1D51                       822
#define TXB1D52                       823
#define TXB1D53                       824
#define TXB1D54                       825
#define TXB1D55                       826
#define TXB1D56                       827
#define TXB1D57                       828
#define TXB1D6                        829
#define TXB1D60                       830
#define TXB1D61                       831
#define TXB1D62                       832
#define TXB1D63                       833
#define TXB1D64                       834
#define TXB1D65                       835
#define TXB1D66                       836
#define TXB1D67                       837
#define TXB1D7                        838
#define TXB1D70                       839
#define TXB1D71                       840
#define TXB1D72                       841
#define TXB1D73                       842
#define TXB1D74                       843
#define TXB1D75                       844
#define TXB1D76                       845
#define TXB1D77                       846
#define CANSTATRO2                    847
#define CANSTATRO2_ICODE0             848
#define CANSTATRO2_ICODE1             849
#define CANSTATRO2_ICODE2             850
#define CANSTATRO2_OPMODE0            851
#define CANSTATRO2_OPMODE1            852
#define CANSTATRO2_OPMODE2            853
#define TXB0CON                       854
#define TXB0PRI0                      855
#define TXB0CON_TXPRI0                856
#define TXB0CON_TXPRI1                857
#define TXB0PRI1                      858
#define TXB0REQ                       859
#define TXB0CON_TXREQ                 860
#define TXB0CON_TXERR                 861
#define TXB0ERR                       862
#define TXB0CON_TXLARB                863
#define TXB0LARB                      864
#define TXB0ABT                       865
#define TXB0CON_TXABT                 866
#define TXB0SIDH                      867
#define TXB0SID3                      868
#define TXB0SIDH_SID3                 869
#define TXB0SID4                      870
#define TXB0SIDH_SID4                 871
#define TXB0SID5                      872
#define TXB0SIDH_SID5                 873
#define TXB0SID6                      874
#define TXB0SIDH_SID6                 875
#define TXB0SID7                      876
#define TXB0SIDH_SID7                 877
#define TXB0SID8                      878
#define TXB0SIDH_SID8                 879
#define TXB0SID9                      880
#define TXB0SIDH_SID9                 881
#define TXB0SIDH_SID10                882
#define TXB0SID10                     883
#define TXB0SIDL                      884
#define TXB0EID16                     885
#define TXB0SIDL_EID16                886
#define TXB0EID17                     887
#define TXB0SIDL_EID17                888
#define TXB0SIDL_EXID                 889
#define TXB0SIDL_EXIDEN               890
#define TXB0EXIDE                     891
#define TXB0SID0                      892
#define TXB0SIDL_SID0                 893
#define TXB0SID1                      894
#define TXB0SIDL_SID1                 895
#define TXB0SID2                      896
#define TXB0SIDL_SID2                 897
#define TXB0EIDH                      898
#define TXB0EID8                      899
#define TXB0EIDH_EID8                 900
#define TXB0EID9                      901
#define TXB0EIDH_EID9                 902
#define TXB0EIDH_EID10                903
#define TXB0EID10                     904
#define TXB0EID11                     905
#define TXB0EIDH_EID11                906
#define TXB0EIDH_EID12                907
#define TXB0EID12                     908
#define TXB0EIDH_EID13                909
#define TXB0EID13                     910
#define TXB0EIDH_EID14                911
#define TXB0EID14                     912
#define TXB0EIDH_EID15                913
#define TXB0EID15                     914
#define TXB0EIDL                      915
#define TXB0EIDL_EID0                 916
#define TXB0EID0                      917
#define TXB0EIDL_EID1                 918
#define TXB0EID1                      919
#define TXB0EIDL_EID2                 920
#define TXB0EID2                      921
#define TXB0EIDL_EID3                 922
#define TXB0EID3                      923
#define TXB0EIDL_EID4                 924
#define TXB0EID4                      925
#define TXB0EIDL_EID5                 926
#define TXB0EID5                      927
#define TXB0EIDL_EID6                 928
#define TXB0EID6                      929
#define TXB0EIDL_EID7                 930
#define TXB0EID7                      931
#define TXB0DLC                       932
#define TXB0DLC0                      933
#define TXB0DLC_DLC0                  934
#define TXB0DLC1                      935
#define TXB0DLC_DLC1                  936
#define TXB0DLC2                      937
#define TXB0DLC_DLC2                  938
#define TXB0DLC3                      939
#define TXB0DLC_DLC3                  940
#define TXB0DLC_TXRTR                 941
#define TXB0RTR                       942
#define TXB0DLC_RTR                   943
#define TXB0D0                        944
#define TXB0D00                       945
#define TXB0D01                       946
#define TXB0D02                       947
#define TXB0D03                       948
#define TXB0D04                       949
#define TXB0D05                       950
#define TXB0D06                       951
#define TXB0D07                       952
#define TXB0D1                        953
#define TXB0D10                       954
#define TXB0D11                       955
#define TXB0D12                       956
#define TXB0D13                       957
#define TXB0D14                       958
#define TXB0D15                       959
#define TXB0D16                       960
#define TXB0D17                       961
#define TXB0D2                        962
#define TXB0D20                       963
#define TXB0D21                       964
#define TXB0D22                       965
#define TXB0D23                       966
#define TXB0D24                       967
#define TXB0D25                       968
#define TXB0D26                       969
#define TXB0D27                       970
#define TXB0D3                        971
#define TXB0D30                       972
#define TXB0D31                       973
#define TXB0D32                       974
#define TXB0D33                       975
#define TXB0D34                       976
#define TXB0D35                       977
#define TXB0D36                       978
#define TXB0D37                       979
#define TXB0D4                        980
#define TXB0D40                       981
#define TXB0D41                       982
#define TXB0D42                       983
#define TXB0D43                       984
#define TXB0D44                       985
#define TXB0D45                       986
#define TXB0D46                       987
#define TXB0D47                       988
#define TXB0D5                        989
#define TXB0D50                       990
#define TXB0D51                       991
#define TXB0D52                       992
#define TXB0D53                       993
#define TXB0D54                       994
#define TXB0D55                       995
#define TXB0D56                       996
#define TXB0D57                       997
#define TXB0D6                        998
#define TXB0D60                       999
#define TXB0D61                       1000
#define TXB0D62                       1001
#define TXB0D63                       1002
#define TXB0D64                       1003
#define TXB0D65                       1004
#define TXB0D66                       1005
#define TXB0D67                       1006
#define TXB0D7                        1007
#define TXB0D70                       1008
#define TXB0D71                       1009
#define TXB0D72                       1010
#define TXB0D73                       1011
#define TXB0D74                       1012
#define TXB0D75                       1013
#define TXB0D76                       1014
#define TXB0D77                       1015
#define CANSTATRO1                    1016
#define CANSTATRO1_ICODE0             1017
#define CANSTATRO1_ICODE1             1018
#define CANSTATRO1_ICODE2             1019
#define CANSTATRO1_OPMODE0            1020
#define CANSTATRO1_OPMODE1            1021
#define CANSTATRO1_OPMODE2            1022
#define RXB1CON                       1023
#define RXB1FILHIT0                   1024
#define RXB1CON_FILHIT0               1025
#define RXB1FILHIT1                   1026
#define FILHIT1                       1027
#define RXB1FILHIT2                   1028
#define FILHIT2                       1029
#define RXB1FILHIT3                   1030
#define RXB1RTRR0                     1031
#define RXB1CON_RXRTRRO               1032
#define RXB1RTRRO                     1033
#define RXB1CON_RXM0                  1034
#define RXB1M0                        1035
#define RXB1M1                        1036
#define RXB1CON_RXM1                  1037
#define RXB1CON_RXFUL                 1038
#define RXB1FUL                       1039
#define RXB1SIDH                      1040
#define RXB1SID3                      1041
#define RXB1SIDH_SID3                 1042
#define RXB1SID4                      1043
#define RXB1SIDH_SID4                 1044
#define RXB1SID5                      1045
#define RXB1SIDH_SID5                 1046
#define RXB1SID6                      1047
#define RXB1SIDH_SID6                 1048
#define RXB1SID7                      1049
#define RXB1SIDH_SID7                 1050
#define RXB1SID8                      1051
#define RXB1SIDH_SID8                 1052
#define RXB1SID9                      1053
#define RXB1SIDH_SID9                 1054
#define RXB1SIDH_SID10                1055
#define RXB1SID10                     1056
#define RXB1SIDL                      1057
#define RXB1SIDL_EID16                1058
#define RXB1EID16                     1059
#define RXB1SIDL_EID17                1060
#define RXB1EID17                     1061
#define RXB1EXID                      1062
#define RXB1SIDL_EXID                 1063
#define RXB1SRR                       1064
#define RXB1SIDL_SRR                  1065
#define RXB1SID0                      1066
#define RXB1SIDL_SID0                 1067
#define RXB1SIDL_SID1                 1068
#define RXB1SID1                      1069
#define RXB1SIDL_SID2                 1070
#define RXB1SID2                      1071
#define RXB1EIDH                      1072
#define RXB1EID8                      1073
#define RXB1EIDH_EID8                 1074
#define RXB1EID9                      1075
#define RXB1EIDH_EID9                 1076
#define RXB1EIDH_EID10                1077
#define RXB1EID10                     1078
#define RXB1EIDH_EID11                1079
#define RXB1EID11                     1080
#define RXB1EIDH_EID12                1081
#define RXB1EID12                     1082
#define RXB1EID13                     1083
#define RXB1EIDH_EID13                1084
#define RXB1EIDH_EID14                1085
#define RXB1EID14                     1086
#define RXB1EIDH_EID15                1087
#define RXB1EID15                     1088
#define RXB1EIDL                      1089
#define RXB1EIDL_EID0                 1090
