tiborsimon/embedded-tdd-headers/pic/8bit/pic18c658_tdd.h
#define RXB1EID0                      1091
#define RXB1EIDL_EID1                 1092
#define RXB1EID1                      1093
#define RXB1EIDL_EID2                 1094
#define RXB1EID2                      1095
#define RXB1EIDL_EID3                 1096
#define RXB1EID3                      1097
#define RXB1EIDL_EID4                 1098
#define RXB1EID4                      1099
#define RXB1EIDL_EID5                 1100
#define RXB1EID5                      1101
#define RXB1EIDL_EID6                 1102
#define RXB1EID6                      1103
#define RXB1EIDL_EID7                 1104
#define RXB1EID7                      1105
#define RXB1DLC                       1106
#define RXB1DLC0                      1107
#define RXB1DLC_DLC0                  1108
#define RXB1DLC1                      1109
#define RXB1DLC_DLC1                  1110
#define RXB1DLC2                      1111
#define RXB1DLC_DLC2                  1112
#define RXB1DLC3                      1113
#define RXB1DLC_DLC3                  1114
#define RXB1DLC_RESB0                 1115
#define RXB1RB0                       1116
#define RESBO                         1117
#define RXB1DLC_RESB1                 1118
#define RXB1RB1                       1119
#define RXB1DLC_RTR                   1120
#define RXB1DLC_RXRTR                 1121
#define RXB1RTR                       1122
#define RXB1D0                        1123
#define RXB1D00                       1124
#define RXB1D01                       1125
#define RXB1D02                       1126
#define RXB1D03                       1127
#define RXB1D04                       1128
#define RXB1D05                       1129
#define RXB1D06                       1130
#define RXB1D07                       1131
#define RXB1D1                        1132
#define RXB1D10                       1133
#define RXB1D11                       1134
#define RXB1D12                       1135
#define RXB1D13                       1136
#define RXB1D14                       1137
#define RXB1D15                       1138
#define RXB1D16                       1139
#define RXB1D17                       1140
#define RXB1D2                        1141
#define RXB1D20                       1142
#define RXB1D21                       1143
#define RXB1D22                       1144
#define RXB1D23                       1145
#define RXB1D24                       1146
#define RXB1D25                       1147
#define RXB1D26                       1148
#define RXB1D27                       1149
#define RXB1D3                        1150
#define RXB1D30                       1151
#define RXB1D31                       1152
#define RXB1D32                       1153
#define RXB1D33                       1154
#define RXB1D34                       1155
#define RXB1D35                       1156
#define RXB1D36                       1157
#define RXB1D37                       1158
#define RXB1D4                        1159
#define RXB1D40                       1160
#define RXB1D41                       1161
#define RXB1D42                       1162
#define RXB1D43                       1163
#define RXB1D44                       1164
#define RXB1D45                       1165
#define RXB1D46                       1166
#define RXB1D47                       1167
#define RXB1D5                        1168
#define RXB1D50                       1169
#define RXB1D51                       1170
#define RXB1D52                       1171
#define RXB1D53                       1172
#define RXB1D54                       1173
#define RXB1D55                       1174
#define RXB1D56                       1175
#define RXB1D57                       1176
#define RXB1D6                        1177
#define RXB1D60                       1178
#define RXB1D61                       1179
#define RXB1D62                       1180
#define RXB1D63                       1181
#define RXB1D64                       1182
#define RXB1D65                       1183
#define RXB1D66                       1184
#define RXB1D67                       1185
#define RXB1D7                        1186
#define RXB1D70                       1187
#define RXB1D71                       1188
#define RXB1D72                       1189
#define RXB1D73                       1190
#define RXB1D74                       1191
#define RXB1D75                       1192
#define RXB1D76                       1193
#define RXB1D77                       1194
#define CANSTATRO0                    1195
#define CANSTATRO0_ICODE0             1196
#define CANSTATRO0_ICODE1             1197
#define CANSTATRO0_ICODE2             1198
#define CANSTATRO0_OPMODE0            1199
#define CANSTATRO0_OPMODE1            1200
#define CANSTATRO0_OPMODE2            1201
#define RXB0CON                       1202
#define RXB0CON_FILHIT0               1203
#define RXB0FILHIT0                   1204
#define RXB0FILHIT1                   1205
#define JTOFF                         1206
#define RXB0FILHIT2                   1207
#define RXB0DBEN                      1208
#define RX0DBEN                       1209
#define RXB0CON_RXRTRRO               1210
#define RXB0FILHIT3                   1211
#define RXB0RTRR0                     1212
#define RXB0RTRRO                     1213
#define RXB0M0                        1214
#define RXB0CON_RXM0                  1215
#define RXB0M1                        1216
#define RXB0CON_RXM1                  1217
#define RXB0CON_RXFUL                 1218
#define RXB0FUL                       1219
#define RXB0SIDH                      1220
#define RXB0SIDH_SID3                 1221
#define RXB0SID3                      1222
#define RXB0SIDH_SID4                 1223
#define RXB0SID4                      1224
#define RXB0SIDH_SID5                 1225
#define RXB0SID5                      1226
#define RXB0SIDH_SID6                 1227
#define RXB0SID6                      1228
#define RXB0SIDH_SID7                 1229
#define RXB0SID7                      1230
#define RXB0SIDH_SID8                 1231
#define RXB0SID8                      1232
#define RXB0SIDH_SID9                 1233
#define RXB0SID9                      1234
#define RXB0SIDH_SID10                1235
#define RXB0SID10                     1236
#define RXB0SIDL                      1237
#define RXB0SIDL_EID16                1238
#define RXB0EID16                     1239
#define RXB0SIDL_EID17                1240
#define RXB0EID17                     1241
#define RXB0EXID                      1242
#define RXB0SIDL_EXID                 1243
#define RXB0SRR                       1244
#define RXB0SIDL_SRR                  1245
#define RXB0SID0                      1246
#define RXB0SIDL_SID0                 1247
#define RXB0SID1                      1248
#define RXB0SIDL_SID1                 1249
#define RXB0SIDL_SID2                 1250
#define RXB0SID2                      1251
#define RXB0EIDH                      1252
#define RXB0EID8                      1253
#define RXB0EIDH_EID8                 1254
#define RXB0EID9                      1255
#define RXB0EIDH_EID9                 1256
#define RXB0EID10                     1257
#define RXB0EIDH_EID10                1258
#define RXB0EID11                     1259
#define RXB0EIDH_EID11                1260
#define RXB0EID12                     1261
#define RXB0EIDH_EID12                1262
#define RXB0EID13                     1263
#define RXB0EIDH_EID13                1264
#define RXB0EID14                     1265
#define RXB0EIDH_EID14                1266
#define RXB0EID15                     1267
#define RXB0EIDH_EID15                1268
#define RXB0EIDL                      1269
#define RXB0EID0                      1270
#define RXB0EIDL_EID0                 1271
#define RXB0EID1                      1272
#define RXB0EIDL_EID1                 1273
#define RXB0EID2                      1274
#define RXB0EIDL_EID2                 1275
#define RXB0EID3                      1276
#define RXB0EIDL_EID3                 1277
#define RXB0EID4                      1278
#define RXB0EIDL_EID4                 1279
#define RXB0EID5                      1280
#define RXB0EIDL_EID5                 1281
#define RXB0EID6                      1282
#define RXB0EIDL_EID6                 1283
#define RXB0EID7                      1284
#define RXB0EIDL_EID7                 1285
#define RXB0DLC                       1286
#define RXB0DLC_DLC0                  1287
#define RXB0DLC0                      1288
#define RXB0DLC_DLC1                  1289
#define RXB0DLC1                      1290
#define RXB0DLC2                      1291
#define RXB0DLC_DLC2                  1292
#define RXB0DLC3                      1293
#define RXB0DLC_DLC3                  1294
#define RXB0RB0                       1295
#define RXB0DLC_RESB0                 1296
#define RXB0RB1                       1297
#define RXB0DLC_RESB1                 1298
#define RXB0RTR                       1299
#define RXB0DLC_RTR                   1300
#define RXB0DLC_RXRTR                 1301
#define RXB0D0                        1302
#define RB0D00                        1303
#define RXB0D00                       1304
#define RB0D01                        1305
#define RXB0D01                       1306
#define RB0D02                        1307
#define RXB0D02                       1308
#define RB0D03                        1309
#define RXB0D03                       1310
#define RB0D04                        1311
#define RXB0D04                       1312
#define RB0D05                        1313
#define RXB0D05                       1314
#define RB0D06                        1315
#define RXB0D06                       1316
#define RB0D07                        1317
#define RXB0D07                       1318
#define RXB0D1                        1319
#define RB0D10                        1320
#define RXB0D10                       1321
#define RB0D11                        1322
#define RXB0D11                       1323
#define RB0D12                        1324
#define RXB0D12                       1325
#define RB0D13                        1326
#define RXB0D13                       1327
#define RB0D14                        1328
#define RXB0D14                       1329
#define RB0D15                        1330
#define RXB0D15                       1331
#define RB0D16                        1332
#define RXB0D16                       1333
#define RB0D17                        1334
#define RXB0D17                       1335
#define RXB0D2                        1336
#define RXB0D20                       1337
#define RB0D20                        1338
#define RXB0D21                       1339
#define RB0D21                        1340
#define RXB0D22                       1341
#define RB0D22                        1342
#define RXB0D23                       1343
#define RB0D23                        1344
#define RXB0D24                       1345
#define RB0D24                        1346
#define RXB0D25                       1347
#define RB0D25                        1348
#define RXB0D26                       1349
#define RB0D26                        1350
#define RXB0D27                       1351
#define RB0D27                        1352
#define RXB0D3                        1353
#define RXB0D30                       1354
#define RB0D30                        1355
#define RXB0D31                       1356
#define RB0D31                        1357
#define RXB0D32                       1358
#define RB0D32                        1359
#define RXB0D33                       1360
#define RB0D33                        1361
#define RXB0D34                       1362
#define RB0D34                        1363
#define RXB0D35                       1364
#define RB0D35                        1365
#define RXB0D36                       1366
#define RB0D36                        1367
#define RXB0D37                       1368
#define RB0D37                        1369
#define RXB0D4                        1370
#define RB0D40                        1371
#define RXB0D40                       1372
#define RB0D41                        1373
#define RXB0D41                       1374
#define RB0D42                        1375
#define RXB0D42                       1376
#define RB0D43                        1377
#define RXB0D43                       1378
#define RB0D44                        1379
#define RXB0D44                       1380
#define RB0D45                        1381
#define RXB0D45                       1382
#define RB0D46                        1383
#define RXB0D46                       1384
#define RB0D47                        1385
#define RXB0D47                       1386
#define RXB0D5                        1387
#define RB0D50                        1388
#define RXB0D50                       1389
#define RB0D51                        1390
#define RXB0D51                       1391
#define RB0D52                        1392
#define RXB0D52                       1393
#define RB0D53                        1394
#define RXB0D53                       1395
#define RB0D54                        1396
#define RXB0D54                       1397
#define RB0D55                        1398
#define RXB0D55                       1399
#define RB0D56                        1400
#define RXB0D56                       1401
#define RB0D57                        1402
#define RXB0D57                       1403
#define RXB0D6                        1404
#define RXB0D60                       1405
#define RB0D60                        1406
#define RXB0D61                       1407
#define RB0D61                        1408
#define RB0D62                        1409
#define RXB0D62                       1410
#define RB0D63                        1411
#define RXB0D63                       1412
#define RB0D64                        1413
#define RXB0D64                       1414
#define RB0D65                        1415
#define RXB0D65                       1416
#define RB0D66                        1417
#define RXB0D66                       1418
#define RXB0D67                       1419
#define RB0D67                        1420
#define RXB0D7                        1421
#define RB0D70                        1422
#define RXB0D70                       1423
#define RB0D71                        1424
#define RXB0D71                       1425
#define RB0D72                        1426
#define RXB0D72                       1427
#define RB0D73                        1428
#define RXB0D73                       1429
#define RB0D74                        1430
#define RXB0D74                       1431
#define RB0D75                        1432
#define RXB0D75                       1433
#define RB0D76                        1434
#define RXB0D76                       1435
#define RB0D77                        1436
#define RXB0D77                       1437
#define CANSTAT                       1438
#define EICODE1                       1439
#define ICOED0                        1440
#define CANSTAT_ICODE0                1441
#define CANSTAT_ICODE1                1442
#define EICODE2                       1443
#define EICODE3                       1444
#define CANSTAT_ICODE2                1445
#define CANSTAT_OPMODE0               1446
#define CANSTAT_OPMODE1               1447
#define CANSTAT_OPMODE2               1448
#define CANCON                        1449
#define WIN0                          1450
#define FP1                           1451
#define WIN1                          1452
#define FP2                           1453
#define FP3                           1454
#define WIN2                          1455
#define ABAT                          1456
#define REQOP0                        1457
#define REQOP1                        1458
#define REQOP2                        1459
#define BRGCON1                       1460
#define BRP0                          1461
#define BRP1                          1462
#define BRP2                          1463
#define BRP3                          1464
#define BRP4                          1465
#define BRP5                          1466
#define SJW0                          1467
#define SJW1                          1468
#define BRGCON2                       1469
#define PRSEG0                        1470
#define PRSEG1                        1471
#define PRSEG2                        1472
#define SEG1PH0                       1473
#define SEG1PH1                       1474
#define SEG1PH2                       1475
#define SAM                           1476
#define SEG2PHT                       1477
#define SEG2PHTS                      1478
#define BRGCON3                       1479
#define SEG2PH0                       1480
#define SEG2PH1                       1481
#define SEG2PH2                       1482
#define WAKFIL                        1483
#define CIOCON                        1484
#define CANCAP                        1485
#define ENDRHI                        1486
#define TX2EN                         1487
#define TX1EN                         1488
#define TX2SRC                        1489
#define TX1SRC                        1490
#define COMSTAT                       1491
#define EWARN                         1492
#define RXWARN                        1493
#define TXWARN                        1494
#define RXBP                          1495
#define TXBP                          1496
#define TXBO                          1497
#define RXB1OVFL                      1498
#define RX1OVFL                       1499
#define RXBNOVFL                      1500
#define RX0OVFL                       1501
#define FIFOEMPTY                     1502
#define RXB0OVFL                      1503
#define RXERRCNT                      1504
#define REC0                          1505
#define REC1                          1506
#define REC2                          1507
#define REC3                          1508
#define REC4                          1509
#define REC5                          1510
#define REC6                          1511
#define REC7                          1512
#define TXERRCNT                      1513
#define TEC0                          1514
#define TEC1                          1515
#define TEC2                          1516
#define TEC3                          1517
#define TEC4                          1518
#define TEC5                          1519
#define TEC6                          1520
#define TEC7                          1521
#define PORTA                         1522
#define ULPWUIN                       1523
#define AN0                           1524
#define PORTA_RA0                     1525
#define AN1                           1526
#define PORTA_RA1                     1527
#define AN2                           1528
#define PORTA_RA2                     1529
#define VREFM                         1530
#define AN3                           1531
#define PORTA_RA3                     1532
#define VREFP                         1533
#define PORTA_RA4                     1534
#define T0CKI                         1535
#define AN4                           1536
#define PORTA_RA5                     1537
#define LVDIN                         1538
#define SS                            1539
#define PORTA_RA6                     1540
#define OSC2                          1541
#define CLK0                          1542
#define PORTB                         1543
#define PORTB_RB0                     1544
#define INT0                          1545
#define PORTB_RB1                     1546
#define INT1                          1547
#define INT2                          1548
#define PORTB_RB2                     1549
#define CCP2_PA2                      1550
#define PORTB_RB3                     1551
#define INT3                          1552
#define PORTB_RB4                     1553
#define PORTB_RB5                     1554
#define PORTB_RB6                     1555
#define PORTB_RB7                     1556
#define PORTC                         1557
#define T1CKI                         1558
#define T1OSO                         1559
#define PORTC_RC0                     1560
#define PORTC_CCP2                    1561
#define T1OSI                         1562
#define PA2                           1563
#define PORTC_RC1                     1564
#define CCP1                          1565
#define PA1                           1566
#define PORTC_RC2                     1567
#define SCL                           1568
#define SCK                           1569
#define PORTC_RC3                     1570
#define SDA                           1571
#define SDI                           1572
#define PORTC_RC4                     1573
#define SDO                           1574
#define PORTC_RC5                     1575
#define TX                            1576
#define CK                            1577
#define PORTC_RC6                     1578
#define DT                            1579
#define RX                            1580
#define PORTC_RC7                     1581
#define PORTD                         1582
#define PORTD_RD0                     1583
#define PSP0                          1584
#define PORTD_RD1                     1585
#define PSP1                          1586
#define PORTD_RD2                     1587
#define PSP2                          1588
#define PORTD_RD3                     1589
#define PSP3                          1590
#define PORTD_RD4                     1591
#define PSP4                          1592
#define PORTD_RD5                     1593
#define PSP5                          1594
#define PORTD_RD6                     1595
#define PSP6                          1596
#define PORTD_RD7                     1597
#define SS2                           1598
#define PSP7                          1599
#define PORTE                         1600
#define PORTE_AN5                     1601
#define NOT_RD                        1602
#define nRD                           1603
#define PD2                           1604
#define RDE                           1605
#define PORTE_RE0                     1606
#define WRE                           1607
#define NOT_WR                        1608
#define nWR                           1609
#define PORTE_RE1                     1610
#define PC2                           1611
#define nCS                           1612
#define NOT_CS                        1613
#define CCP10                         1614
#define PB2                           1615
#define CS                            1616
#define PORTE_RE2                     1617
#define CCP9E                         1618
#define PORTE_RE3                     1619
#define PC3E                          1620
#define PB3E                          1621
#define PORTE_RE4                     1622
#define CCP8E                         1623
#define CCP7E                         1624
#define PORTE_RE5                     1625
#define PC1E                          1626
#define CCP6E                         1627
#define PORTE_RE6                     1628
#define PB1E                          1629
#define PORTE_CCP2                    1630
#define CCP2E                         1631
#define PORTE_RE7                     1632
#define PA2E                          1633
#define PORTF                         1634
#define PORTF_RF0                     1635
#define PORTF_AN5                     1636
#define PORTF_RF1                     1637
#define C2OUTF                        1638
#define AN6                           1639
#define PORTF_RF2                     1640
#define AN7                           1641
#define C1OUTF                        1642
#define PORTF_RF3                     1643
#define AN8                           1644
#define PORTF_RF4                     1645
#define AN9                           1646
#define PORTF_RF5                     1647
#define AN10                          1648
