tiborsimon/embedded-tdd-headers/pic/8bit/pic18c658_tdd.h
#define PORTF_RF6                     1649
#define AN11                          1650
#define PORTF_RF7                     1651
#define PORTG                         1652
#define CANTX1                        1653
#define PORTG_RG0                     1654
#define PORTG_RG1                     1655
#define C3OUTG                        1656
#define CANTX2                        1657
#define CANRX                         1658
#define PORTG_RG2                     1659
#define PORTG_RG3                     1660
#define PORTG_RG4                     1661
#define LATA                          1662
#define LATA0                         1663
#define LA0                           1664
#define LATA1                         1665
#define LA1                           1666
#define LATA2                         1667
#define LA2                           1668
#define LATA3                         1669
#define LA3                           1670
#define LATA4                         1671
#define LA4                           1672
#define LATA5                         1673
#define LA5                           1674
#define LATA6                         1675
#define LA6                           1676
#define LATB                          1677
#define LB0                           1678
#define LATB0                         1679
#define LB1                           1680
#define LATB1                         1681
#define LB2                           1682
#define LATB2                         1683
#define LB3                           1684
#define LATB3                         1685
#define LB4                           1686
#define LATB4                         1687
#define LB5                           1688
#define LATB5                         1689
#define LB6                           1690
#define LATB6                         1691
#define LB7                           1692
#define LATB7                         1693
#define LATC                          1694
#define LATC0                         1695
#define LC0                           1696
#define LATC1                         1697
#define LC1                           1698
#define LATC2                         1699
#define LC2                           1700
#define LATC3                         1701
#define LC3                           1702
#define LATC4                         1703
#define LC4                           1704
#define LATC5                         1705
#define LC5                           1706
#define LATC6                         1707
#define LC6                           1708
#define LATC7                         1709
#define LC7                           1710
#define LATD                          1711
#define LATD0                         1712
#define LD0                           1713
#define LATD1                         1714
#define LD1                           1715
#define LATD2                         1716
#define LD2                           1717
#define LATD3                         1718
#define LD3                           1719
#define LATD4                         1720
#define LD4                           1721
#define LATD5                         1722
#define LD5                           1723
#define LATD6                         1724
#define LD6                           1725
#define LATD7                         1726
#define LD7                           1727
#define LATE                          1728
#define LATE0                         1729
#define LE0                           1730
#define LATE1                         1731
#define LE1                           1732
#define LATE2                         1733
#define LE2                           1734
#define LATE3                         1735
#define LE3                           1736
#define LATE4                         1737
#define LE4                           1738
#define LATE5                         1739
#define LE5                           1740
#define LATE6                         1741
#define LE6                           1742
#define LATE7                         1743
#define LE7                           1744
#define LATF                          1745
#define LATF0                         1746
#define LF0                           1747
#define LATF1                         1748
#define LF1                           1749
#define LF2                           1750
#define LATF2                         1751
#define LF3                           1752
#define LATF3                         1753
#define LF4                           1754
#define LATF4                         1755
#define LF5                           1756
#define LATF5                         1757
#define LF6                           1758
#define LATF6                         1759
#define LF7                           1760
#define LATF7                         1761
#define LATG                          1762
#define LATG0                         1763
#define LG0                           1764
#define LATG1                         1765
#define LG1                           1766
#define LATG2                         1767
#define LG2                           1768
#define LATG3                         1769
#define LG3                           1770
#define LATG4                         1771
#define LG4                           1772
#define TRISA                         1773
#define TRISA_RA0                     1774
#define TRISA0                        1775
#define TRISA_RA1                     1776
#define TRISA1                        1777
#define TRISA2                        1778
#define TRISA_RA2                     1779
#define TRISA_RA3                     1780
#define TRISA3                        1781
#define TRISA_RA4                     1782
#define TRISA4                        1783
#define TRISA_RA5                     1784
#define TRISA5                        1785
#define TRISA_RA6                     1786
#define TRISA6                        1787
#define TRISB                         1788
#define TRISB_RB0                     1789
#define TRISB0                        1790
#define TRISB_RB1                     1791
#define TRISB1                        1792
#define TRISB_RB2                     1793
#define TRISB2                        1794
#define TRISB_RB3                     1795
#define TRISB3                        1796
#define TRISB_RB4                     1797
#define TRISB4                        1798
#define TRISB_RB5                     1799
#define TRISB5                        1800
#define TRISB_RB6                     1801
#define TRISB6                        1802
#define TRISB_RB7                     1803
#define TRISB7                        1804
#define TRISC                         1805
#define TRISC0                        1806
#define TRISC_RC0                     1807
#define TRISC1                        1808
#define TRISC_RC1                     1809
#define TRISC2                        1810
#define TRISC_RC2                     1811
#define TRISC3                        1812
#define TRISC_RC3                     1813
#define TRISC4                        1814
#define TRISC_RC4                     1815
#define TRISC5                        1816
#define TRISC_RC5                     1817
#define TRISC6                        1818
#define TRISC_RC6                     1819
#define TRISC7                        1820
#define TRISC_RC7                     1821
#define TRISD                         1822
#define TRISD_RD0                     1823
#define TRISD0                        1824
#define TRISD_RD1                     1825
#define TRISD1                        1826
#define TRISD_RD2                     1827
#define TRISD2                        1828
#define TRISD_RD3                     1829
#define TRISD3                        1830
#define TRISD_RD4                     1831
#define TRISD4                        1832
#define TRISD_RD5                     1833
#define TRISD5                        1834
#define TRISD_RD6                     1835
#define TRISD6                        1836
#define TRISD_RD7                     1837
#define TRISD7                        1838
#define TRISE                         1839
#define TRISE_RE0                     1840
#define TRISE0                        1841
#define TRISE1                        1842
#define TRISE_RE1                     1843
#define TRISE2                        1844
#define TRISE_RE2                     1845
#define TRISE_RE3                     1846
#define TRISE3                        1847
#define TRISE_RE4                     1848
#define TRISE4                        1849
#define TRISE_RE5                     1850
#define TRISE5                        1851
#define TRISE_RE6                     1852
#define TRISE6                        1853
#define TRISE_RE7                     1854
#define TRISE7                        1855
#define TRISF                         1856
#define TRISF0                        1857
#define TRISF_RF0                     1858
#define TRISF_RF1                     1859
#define TRISF1                        1860
#define TRISF_RF2                     1861
#define TRISF2                        1862
#define TRISF3                        1863
#define TRISF_RF3                     1864
#define TRISF_RF4                     1865
#define TRISF4                        1866
#define TRISF_RF5                     1867
#define TRISF5                        1868
#define TRISF_RF6                     1869
#define TRISF6                        1870
#define TRISF7                        1871
#define TRISF_RF7                     1872
#define TRISG                         1873
#define TRISG0                        1874
#define TRISG_RG0                     1875
#define TRISG1                        1876
#define TRISG_RG1                     1877
#define TRISG2                        1878
#define TRISG_RG2                     1879
#define TRISG_RG3                     1880
#define TRISG3                        1881
#define TRISG4                        1882
#define TRISG_RG4                     1883
#define PIE1                          1884
#define TMR1IE                        1885
#define TMR2IE                        1886
#define CCP1IE                        1887
#define SSPIE                         1888
#define TXIE                          1889
#define TX1IE                         1890
#define RCIE                          1891
#define RC1IE                         1892
#define ADIE                          1893
#define PSPIE                         1894
#define PIR1                          1895
#define TMR1IF                        1896
#define TMR2IF                        1897
#define CCP1IF                        1898
#define SSPIF                         1899
#define TXIF                          1900
#define TX1IF                         1901
#define RCIF                          1902
#define RC1IF                         1903
#define ADIF                          1904
#define PSPIF                         1905
#define IPR1                          1906
#define TMR1IP                        1907
#define TMR2IP                        1908
#define CCP1IP                        1909
#define SSPIP                         1910
#define TX1IP                         1911
#define TXIP                          1912
#define RC1IP                         1913
#define RCIP                          1914
#define ADIP                          1915
#define PSPIP                         1916
#define PIE2                          1917
#define CCP2IE                        1918
#define TMR3IE                        1919
#define LVDIE                         1920
#define BCLIE                         1921
#define CMIE                          1922
#define PIR2                          1923
#define CCP2IF                        1924
#define TMR3IF                        1925
#define LVDIF                         1926
#define BCLIF                         1927
#define CMIF                          1928
#define IPR2                          1929
#define CCP2IP                        1930
#define TMR3IP                        1931
#define LVDIP                         1932
#define BCLIP                         1933
#define CMIP                          1934
#define PIE3                          1935
#define RXB0IE                        1936
#define RXBNIE                        1937
#define RXB1IE                        1938
#define TXB0IE                        1939
#define TXB1IE                        1940
#define TXB2IE                        1941
#define TXBNIE                        1942
#define ERRIE                         1943
#define WAKIE                         1944
#define IRXIE                         1945
#define PIR3                          1946
#define RXB0IF                        1947
#define RXBNIF                        1948
#define RXB1IF                        1949
#define TXB0IF                        1950
#define TXB1IF                        1951
#define TXB2IF                        1952
#define TXBNIF                        1953
#define ERRIF                         1954
#define WAKIF                         1955
#define IRXIF                         1956
#define IPR3                          1957
#define RXB0IP                        1958
#define RXB1IP                        1959
#define RXBNIP                        1960
#define TXB0IP                        1961
#define TXB1IP                        1962
#define TXB2IP                        1963
#define TXBNIP                        1964
#define ERRIP                         1965
#define WAKIP                         1966
#define IRXIP                         1967
#define RCSTA                         1968
#define RCD8                          1969
#define RX9D                          1970
#define OERR                          1971
#define FERR                          1972
#define ADDEN                         1973
#define ADEN                          1974
#define CREN                          1975
#define SRENA                         1976
#define SREN                          1977
#define RC9                           1978
#define RC8_9                         1979
#define RX9                           1980
#define SPEN                          1981
#define TXSTA                         1982
#define TXD8                          1983
#define TX9D1                         1984
#define TX9D                          1985
#define TRMT                          1986
#define TRMT1                         1987
#define BRGH1                         1988
#define BRGH                          1989
#define SYNC                          1990
#define SYNC1                         1991
#define TXEN1                         1992
#define TXEN                          1993
#define TX91                          1994
#define TX8_9                         1995
#define TX9                           1996
#define CSRC1                         1997
#define CSRC                          1998
#define PSPCON                        1999
#define PSPMODE                       2000
#define IBOV                          2001
#define OBF                           2002
#define IBF                           2003
#define T3CON                         2004
#define TMR3ON                        2005
#define TMR3CS                        2006
#define nT3SYNC                       2007
#define NOT_T3SYNC                    2008
#define T3SYNC                        2009
#define T3INSYNC                      2010
#define SOSCEN3                       2011
#define T3CCP1                        2012
#define T3CKPS                        2013
#define T3CKPS0                       2014
#define T3CKPS1                       2015
#define T3CCP2                        2016
#define T3CON_RD16                    2017
#define RD163                         2018
#define T3RD16                        2019
#define CMCON                         2020
#define CM                            2021
#define CMEN0                         2022
#define CM0                           2023
#define CMEN1                         2024
#define CM1                           2025
#define CMEN2                         2026
#define CM2                           2027
#define CIS                           2028
#define C1INV                         2029
#define C2INV                         2030
#define C1OUT                         2031
#define C2OUT                         2032
#define CVRCON                        2033
#define VR                            2034
#define VR0                           2035
#define CVR0                          2036
#define VR1                           2037
#define CVR1                          2038
#define VR2                           2039
#define CVR2                          2040
#define VR3                           2041
#define CVR3                          2042
#define CVRSS                         2043
#define VRSS                          2044
#define VRR                           2045
#define CRR                           2046
#define CVRR                          2047
#define VROEN                         2048
#define CVROEN                        2049
#define VROE                          2050
#define VREN                          2051
#define CVREN                         2052
#define CCP2CON                       2053
#define CCP2M                         2054
#define CCP2M0                        2055
#define CCP2M1                        2056
#define CCP2M2                        2057
#define CCP2CON_CCPM3                 2058
#define CCP2M3                        2059
#define DC2B0                         2060
#define CCP2Y                         2061
#define DC2B                          2062
#define DC2B1                         2063
#define CCP2X                         2064
#define DCCPX                         2065
#define CCP1CON                       2066
#define CCP1M0                        2067
#define CCP1M                         2068
#define CCP1M1                        2069
#define CCP1M2                        2070
#define CCP1M3                        2071
#define CCP1CON_CCPM3                 2072
#define CCP1Y                         2073
#define DC1B                          2074
#define DC1B0                         2075
#define CCP1X                         2076
#define DC1B1                         2077
#define ADCON2                        2078
#define ADCS                          2079
#define ADCS0                         2080
#define ADCS1                         2081
#define ADCS2                         2082
#define ADFM                          2083
#define ADCON1                        2084
#define PCFG0                         2085
#define PCFG                          2086
#define PCFG1                         2087
#define PCFG2                         2088
#define CHSN3                         2089
#define PCFG3                         2090
#define VCFG                          2091
#define VCFG0                         2092
#define VCFG01                        2093
#define VCFG11                        2094
#define VCFG1                         2095
#define ADCON0                        2096
#define ADON                          2097
#define nDONE                         2098
#define GO_nDONE                      2099
#define NOT_DONE                      2100
#define GODONE                        2101
#define GO_DONE                       2102
#define DONE                          2103
#define GO_NOT_DONE                   2104
#define GO                            2105
#define CHS                           2106
#define CHS0                          2107
#define CHS1                          2108
#define CHS2                          2109
#define CHS3                          2110
#define SSPCON2                       2111
#define SEN                           2112
#define RSEN                          2113
#define PEN                           2114
#define RCEN                          2115
#define ACKEN                         2116
#define ACKDT                         2117
#define ACKSTAT                       2118
#define GCEN                          2119
#define SSPCON1                       2120
#define SSPM0                         2121
#define SSPM                          2122
#define SSPM1                         2123
#define SSPM2                         2124
#define SSPM3                         2125
#define CKP                           2126
#define SSPEN                         2127
#define SSPOV                         2128
#define WCOL                          2129
#define SSPSTAT                       2130
#define BF                            2131
#define UA                            2132
#define R_NOT_W                       2133
#define READ_WRITE                    2134
#define NOT_W                         2135
#define R_W                           2136
#define RW                            2137
#define R                             2138
#define NOT_WRITE                     2139
#define nW                            2140
#define nWRITE                        2141
#define R_nW                          2142
#define I2C_READ                      2143
#define START                         2144
#define S                             2145
#define I2C_START                     2146
#define STOP                          2147
#define I2C_STOP                      2148
#define P                             2149
#define NOT_A                         2150
#define I2C_DATA                      2151
#define nA                            2152
#define D_nA                          2153
#define D                             2154
#define DA                            2155
#define DATA_ADDRESS                  2156
#define D_A                           2157
#define D_NOT_A                       2158
#define NOT_ADDRESS                   2159
#define nADDRESS                      2160
#define I2C_DAT                       2161
#define CKE                           2162
#define SMP                           2163
#define T2CON                         2164
#define T2CKPS0                       2165
#define T2CKPS                        2166
#define T2CKPS1                       2167
#define TMR2ON                        2168
#define TOUTPS0                       2169
#define TOUTPS                        2170
#define TOUTPS1                       2171
#define TOUTPS2                       2172
#define TOUTPS3                       2173
#define PR2                           2174
#define WM0                           2175
#define WM1                           2176
#define WAIT0                         2177
#define WAIT1                         2178
#define EBDIS                         2179
#define T1CON                         2180
#define TMR1ON                        2181
#define TMR1CS                        2182
#define NOT_T1SYNC                    2183
#define T1SYNC                        2184
#define nT1SYNC                       2185
#define T1INSYNC                      2186
#define T1OSCEN                       2187
#define SOSCEN                        2188
#define T1CKPS0                       2189
#define T1CKPS                        2190
#define T1CKPS1                       2191
#define T1RD16                        2192
#define T1CON_RD16                    2193
#define RCON                          2194
#define BOR                           2195
#define NOT_BOR                       2196
#define nBOR                          2197
#define POR                           2198
#define nPOR                          2199
#define NOT_POR                       2200
#define nPD                           2201
#define NOT_PD                        2202
#define PD                            2203
#define TO                            2204
#define NOT_TO                        2205
#define nTO                           2206
