tiborsimon/embedded-tdd-headers/pic/8bit/pic18c658_tdd.h
#define nRI                           2207
#define NOT_RI                        2208
#define RI                            2209
#define NOT_LWRT                      2210
#define nLWRT                         2211
#define LWRT                          2212
#define IPEN                          2213
#define NOT_IPEN                      2214
#define nIPEN                         2215
#define WDTCON                        2216
#define SWDTE                         2217
#define SWDTEN                        2218
#define LVDCON                        2219
#define LVDL0                         2220
#define LVDL                          2221
#define LVDL1                         2222
#define LVDL2                         2223
#define LVDL3                         2224
#define LVDEN                         2225
#define IRVST                         2226
#define OSCCON                        2227
#define SCS                           2228
#define T0CON                         2229
#define T0PS                          2230
#define T0PS0                         2231
#define T0PS1                         2232
#define T0PS2                         2233
#define PSA                           2234
#define T0PS3                         2235
#define T0SE                          2236
#define T0CS                          2237
#define T08BIT                        2238
#define T016BIT                       2239
#define TMR0ON                        2240
#define STATUS                        2241
#define C                             2242
#define CARRY                         2243
#define DC                            2244
#define ZERO                          2245
#define Z                             2246
#define OV                            2247
#define OVERFLOW                      2248
#define N                             2249
#define NEGATIVE                      2250
#define INTCON3                       2251
#define INT1IF                        2252
#define INT1F                         2253
#define INT2IF                        2254
#define INT2F                         2255
#define INT3F                         2256
#define INT3IF                        2257
#define INT1E                         2258
#define INT1IE                        2259
#define INT2IE                        2260
#define INT2E                         2261
#define INT3E                         2262
#define INT3IE                        2263
#define INT1P                         2264
#define INT1IP                        2265
#define INT2IP                        2266
#define INT2P                         2267
#define INTCON2                       2268
#define RBIP                          2269
#define INT3IP                        2270
#define INT3P                         2271
#define TMR0IP                        2272
#define T0IP                          2273
#define INTEDG3                       2274
#define INTEDG2                       2275
#define INTEDG1                       2276
#define INTEDG0                       2277
#define RBPU                          2278
#define NOT_RBPU                      2279
#define nRBPU                         2280
#define INTCON                        2281
#define RBIF                          2282
#define INT0F                         2283
#define INT0IF                        2284
#define T0IF                          2285
#define TMR0IF                        2286
#define RBIE                          2287
#define INT0E                         2288
#define INT0IE                        2289
#define T0IE                          2290
#define TMR0IE                        2291
#define PEIE                          2292
#define PEIE_GIEL                     2293
#define GIEL                          2294
#define GIE_GIEH                      2295
#define GIE                           2296
#define GIEH                          2297
#define STKPTR0                       2298
#define STKPTR                        2299
#define SP0                           2300
#define STKPTR1                       2301
#define SP1                           2302
#define STKPTR2                       2303
#define SP2                           2304
#define SP3                           2305
#define STKPTR3                       2306
#define STKPTR4                       2307
#define SP4                           2308
#define STKUNF                        2309
#define STKOVF                        2310
#define STKFUL                        2311

#endif // _PIC18C658_H_
